sasikumar161106/subsense/edge/firmware/esp32_subsense_test/esp32_subsense_test.ino
/**
 * @file esp32_subsense_test.ino
 * @brief SubSense TinyML On-Device Hardware Test & Benchmark Console for ESP32.
 * @note Compatible with Arduino IDE 1.8.x, 2.x and PlatformIO.
 * 
 * Instructions:
 * 1. Open this file in Arduino IDE.
 * 2. Select Board: "ESP32 Dev Module" (or your specific ESP32 variant).
 * 3. Select Port: Your ESP32 COM port.
 * 4. Upload and open Serial Monitor at 115200 baud.
 */

#include <Arduino.h>
#include "subsense_features.h"
#include "subsense_inference_engine.h"
#include "subsense_fallback.h"
#include "subsense_power_mgmt.h"
#include "subsense_gateway_model.h"
#include "subsense_node_model.h"
#include "subsense_wifi_mesh.h"

// Set to 1 if this board is GATEWAY (receives mesh packets), 0 if NODE (sends telemetry)
#define SUBSENSE_IS_GATEWAY   0

// Hardware Pin Configuration
// Most ESP32 DevKit boards have an onboard blue LED on GPIO 2.
// Change this if your board uses a different pin (e.g., GPIO 13 or external buzzer pin).
#define PIN_SIREN_LED   2

// Gateway mesh packet reception handler
static void on_mesh_data_received(const char* json_payload, size_t len, const uint8_t sender_mac[6]) {
    Serial.printf("\n[MESH RX] From %02X:%02X:%02X:%02X:%02X:%02X (%u bytes):\n%s\n\n",
           sender_mac[0], sender_mac[1], sender_mac[2],
           sender_mac[3], sender_mac[4], sender_mac[5],
           (unsigned)len, json_payload);
}

// Static system components
static SubSenseWindowBuffer     g_win_buf;
static SubSenseHealthTelemetry  g_health;
static SubSenseFeatureConfig    g_feat_config;
static SubSenseInferenceConfig  g_gw_inf_config;
static SubSenseInferenceConfig  g_node_inf_config;
static SubSensePowerConfig      g_pwr_config;

// JSON event and health buffers
static char g_json_buf[SUBSENSE_JSON_EVENT_MAX_LEN];
static char g_health_buf[256];

// Benchmark test vectors
// Calibrated nominal baseline INT8 tensor (mean normal values)
static const int8_t TEST_VEC_NOMINAL[8] = { 0, 0, 0, 0, 0, 0, 0, 0 };

// Early Warning INT8 tensor (increasing tilt rate & vibration)
static const int8_t TEST_VEC_WARNING[8] = { 25, 45, 30, 55, 35, 20, 10, 15 };

// Severe Anomaly INT8 tensor (roof shear, high crack propagation, shockwave)
static const int8_t TEST_VEC_CRITICAL[8] = { 85, 110, 95, 120, 105, 115, 120, 100 };

void setup_subsense() {
    // 1. Initialize ring buffer
    subsense_buffer_init(&g_win_buf);

    // 2. Configure Gateway Tier inference config
    g_gw_inf_config.warning_threshold = SUBSENSE_GW_INT_THRESHOLD; // 474
    g_gw_inf_config.critical_threshold = 950;
    g_gw_inf_config.node_id = "ESP32-GW-01";
    g_gw_inf_config.model_version = "gw-autoencoder-v1.3.0";
    g_gw_inf_config.source_tier = "gateway";

    // 3. Configure Node Tier inference config
    g_node_inf_config.warning_threshold = SUBSENSE_NODE_INT_THRESHOLD; // 115
    g_node_inf_config.critical_threshold = SUBSENSE_NODE_INT_THRESHOLD;
    g_node_inf_config.node_id = "ESP32-NODE-01";
    g_node_inf_config.model_version = "node-detector-v1.3.0";
    g_node_inf_config.source_tier = "node";

    // 4. Configure feature normalizer & quantization constants
    g_feat_config.scaler_mean[0] = 0.010298f;  g_feat_config.scaler_scale[0] = 0.077703f;
    g_feat_config.scaler_mean[1] = 0.000011f;  g_feat_config.scaler_scale[1] = 0.001341f;
    g_feat_config.scaler_mean[2] = 0.000893f;  g_feat_config.scaler_scale[2] = 0.000220f;
    g_feat_config.scaler_mean[3] = 0.043559f;  g_feat_config.scaler_scale[3] = 0.023900f;
    g_feat_config.scaler_mean[4] = 0.332180f;  g_feat_config.scaler_scale[4] = 2.029822f;
    g_feat_config.scaler_mean[5] = -0.000056f; g_feat_config.scaler_scale[5] = 0.020145f;
    g_feat_config.scaler_mean[6] = 0.0f;       g_feat_config.scaler_scale[6] = 1.0f;
    g_feat_config.scaler_mean[7] = 0.0f;       g_feat_config.scaler_scale[7] = 1.0f;
    g_feat_config.quant_input_scale = 0.029008f;
    g_feat_config.quant_input_zp = 0;

    // 5. Initialize inference & health telemetry
    subsense_inference_init(&g_gw_inf_config, &g_health);

    // 6. Initialize power config
    g_pwr_config.mode = POWER_MODE_BATTERY_DUTY_CYCLE;
    g_pwr_config.sampling_interval_ms = 1000;
    g_pwr_config.active_duration_us = 400; // ~0.4 ms
    g_pwr_config.active_current_ma = 50.0f;
    g_pwr_config.deep_sleep_current_ua = 10.0f;
    g_pwr_config.battery_capacity_mah = 2600.0f;
    subsense_power_init(&g_pwr_config);

    // 7. Initialize WiFi Mesh (ESP-NOW) transport
#if SUBSENSE_IS_GATEWAY
    subsense_wifi_mesh_init(SUBSENSE_MESH_ROLE_GATEWAY, on_mesh_data_received);
    Serial.println("  [WiFi Mesh] Initialized in GATEWAY mode (listening for node packets).");
#else
    subsense_wifi_mesh_init(SUBSENSE_MESH_ROLE_NODE, NULL);
    Serial.println("  [WiFi Mesh] Initialized in NODE mode (broadcasting packets).");
#endif
}

void print_separator() {
    Serial.println("================================================================================");
}

void test_node_model() {
    print_separator();
    Serial.println(">>> BENCHMARK 1: Node-Tier Ultra-Fast INT8 Anomaly Detector (8 -> 16 -> 1)");
    print_separator();
    Serial.println("Model Specs: Pure integer fixed-point GEMM, 212 Bytes Flash, 16 Bytes RAM");
    Serial.println();

    // 1. Nominal Input Test
    uint32_t t_start = micros();
    uint8_t alert_nom = subsense_node_infer_int8(TEST_VEC_NOMINAL);
    uint32_t t_nom = micros() - t_start;

    Serial.print("  [Test 1.1] Nominal Vector [0,0,0,0,0,0,0,0] -> Alert: ");
    Serial.print(alert_nom);
    Serial.print(" | Latency: ");
    Serial.print(t_nom);
    Serial.print(" us | Result: ");
    if (alert_nom == 0) {
        Serial.println("PASS (Nominal / No Siren)");
    } else {
        Serial.println("FAIL (False positive)");
    }

    // 2. Anomaly Input Test
    t_start = micros();
    uint8_t alert_anom = subsense_node_infer_int8(TEST_VEC_CRITICAL);
    uint32_t t_anom = micros() - t_start;

    Serial.print("  [Test 1.2] Anomaly Vector [Severe Excursion] -> Alert: ");
    Serial.print(alert_anom);
    Serial.print(" | Latency: ");
    Serial.print(t_anom);
    Serial.print(" us | Result: ");
    if (alert_anom == 1) {
        Serial.println("PASS (CRITICAL SIREN FIRED!)");
    } else {
        Serial.println("FAIL (Missed detection)");
    }

    Serial.println();
    Serial.println("  Hardware Speed: Sub-5 microsecond local siren actuation without network roundtrip!");
}

void test_gateway_model() {
    print_separator();
    Serial.println(">>> BENCHMARK 2: Gateway-Tier 6-Layer INT8 Autoencoder (8->128->64->32->64->128->8)");
    print_separator();
    Serial.println("Model Specs: INT8 Quantized Autoencoder MSE, 23.7 KB Flash, 256 Bytes RAM");
    Serial.println();

    // 1. Nominal Input Test
    int8_t recon_nom[8];
    uint32_t t_start = micros();
    uint32_t mse_nom = subsense_gateway_infer_int8(TEST_VEC_NOMINAL, recon_nom);
    uint32_t t_nom = micros() - t_start;

    float score_nom = (float)mse_nom / ((float)mse_nom + (float)g_gw_inf_config.warning_threshold);

    Serial.print("  [Test 2.1] Nominal Vector -> Recon MSE: ");
    Serial.print(mse_nom);
    Serial.print(" (Warn Threshold: ");
    Serial.print(g_gw_inf_config.warning_threshold);
    Serial.print(") | Score: ");
    Serial.print(score_nom, 4);
    Serial.print(" | Latency: ");
    Serial.print(t_nom);
    Serial.print(" us | Result: ");
    if (mse_nom < g_gw_inf_config.warning_threshold) {
        Serial.println("PASS (Nominal Ground)");
    } else {
        Serial.println("FAIL (Unexpected breach)");
    }

    // 2. Warning Vector Test
    int8_t recon_warn[8];
    t_start = micros();
    uint32_t mse_warn = subsense_gateway_infer_int8(TEST_VEC_WARNING, recon_warn);
    uint32_t t_warn = micros() - t_start;
    float score_warn = (float)mse_warn / ((float)mse_warn + (float)g_gw_inf_config.warning_threshold);

