sasikumar161106/subsense/edge/firmware/esp32_subsense_test/esp32_subsense_test.ino
    Serial.print("  [Test 2.2] Warning Vector -> Recon MSE: ");
    Serial.print(mse_warn);
    Serial.print(" | Score: ");
    Serial.print(score_warn, 4);
    Serial.print(" | Latency: ");
    Serial.print(t_warn);
    Serial.print(" us | Result: ");
    if (mse_warn >= g_gw_inf_config.warning_threshold && mse_warn < g_gw_inf_config.critical_threshold) {
        Serial.println("PASS (WARNING BREACH DETECTED)");
    } else {
        Serial.print("MSE: "); Serial.println(mse_warn);
    }

    // 3. Critical Vector Test
    int8_t recon_crit[8];
    t_start = micros();
    uint32_t mse_crit = subsense_gateway_infer_int8(TEST_VEC_CRITICAL, recon_crit);
    uint32_t t_crit = micros() - t_start;
    float score_crit = (float)mse_crit / ((float)mse_crit + (float)g_gw_inf_config.warning_threshold);

    Serial.print("  [Test 2.3] Critical Hazard -> Recon MSE: ");
    Serial.print(mse_crit);
    Serial.print(" (Crit Threshold: ");
    Serial.print(g_gw_inf_config.critical_threshold);
    Serial.print(") | Score: ");
    Serial.print(score_crit, 4);
    Serial.print(" | Latency: ");
    Serial.print(t_crit);
    Serial.print(" us | Result: ");
    if (mse_crit >= g_gw_inf_config.critical_threshold) {
        Serial.println("PASS (CRITICAL SIREN TRIGGERED!)");
    } else {
        Serial.println("FAIL (Expected critical)");
    }
}

void test_full_pipeline() {
    print_separator();
    Serial.println(">>> BENCHMARK 3: End-to-End Pipeline & Standardized JSON Risk Event");
    print_separator();
    Serial.println("Flow: Raw Window (32) -> Features (8) -> INT8 Normalization -> Inference -> Event JSON");
    Serial.println();

    // Re-initialize buffer
    subsense_buffer_init(&g_win_buf);

    // Push 32 synthetic samples representing an impending roof collapse
    Serial.println("  Streaming 32-sample sliding window into ring buffer...");
    for (int i = 0; i < SUBSENSE_WINDOW_SIZE; i++) {
        // Accelerating tilt and vibration spikes towards end of window
        float progress = (float)i / 32.0f;
        float tilt = 0.05f + progress * 0.85f;
        float vib = 0.02f + (i > 24 ? 0.35f : 0.04f);
        float disp = 0.1f + progress * 3.5f;
        float crack = (i > 20 ? 0.65f : 0.05f);
        subsense_buffer_push(&g_win_buf, tilt, vib, disp, crack);
    }

    // 1. Extract features
    float raw_features[SUBSENSE_NUM_FEATURES];
    uint32_t t0 = micros();
    subsense_extract_features(&g_win_buf, raw_features);
    uint32_t t_feat = micros() - t0;

    Serial.print("  1. Extracted 8 Features in "); Serial.print(t_feat); Serial.println(" us:");
    Serial.print("     Tilt Cur: "); Serial.print(raw_features[0], 4);
    Serial.print(" deg | Tilt RoC: "); Serial.print(raw_features[1], 4);
    Serial.print(" deg/win | Tilt Var: "); Serial.println(raw_features[2], 6);
    Serial.print("     Vib RMS:  "); Serial.print(raw_features[3], 4);
    Serial.print(" g   | Vib Peaks: "); Serial.print(raw_features[4], 1);
    Serial.print("     | Disp Delta: "); Serial.print(raw_features[5], 4); Serial.println(" mm");
    Serial.print("     Crack St: "); Serial.print(raw_features[6], 2);
    Serial.print("     | Crack Acts: "); Serial.println(raw_features[7], 1);

    // 2. Normalize and Quantize to INT8
    int8_t in_int8[SUBSENSE_NUM_FEATURES];
    t0 = micros();
    subsense_features_to_int8(raw_features, &g_feat_config, in_int8);
    uint32_t t_quant = micros() - t0;

    Serial.print("  2. INT8 Quantized Tensor ("); Serial.print(t_quant); Serial.print(" us): [");
    for (int i = 0; i < 8; i++) {
        Serial.print(in_int8[i]);
        if (i < 7) Serial.print(", ");
    }
    Serial.println("]");

    // 3. Run Inference Engine
    SubSenseDetectionEvent event;
    t0 = micros();
    bool breached = subsense_run_inference(
        in_int8,
        raw_features,
        "2026-09-09T21:45:00Z",
        &g_gw_inf_config,
        &event,
        &g_health
    );
    uint32_t t_inf = micros() - t0;

    Serial.print("  3. TinyML Inference completed in "); Serial.print(t_inf); Serial.println(" us.");
    Serial.print("     Threshold Breached: "); Serial.println(event.threshold_breached);
    Serial.print("     Anomaly Score: "); Serial.println(event.anomaly_score, 4);
    Serial.print("     Confidence: "); Serial.println(event.local_confidence, 2);
    Serial.print("     Siren Triggered: "); Serial.println(event.siren_triggered ? "YES" : "NO");

    // 4. Evaluate Safety Fallback
    char fallback_reason[64];
    bool fallback_siren = false;
    bool raw_hazard = subsense_fallback_evaluate(
        raw_features[0], raw_features[1], raw_features[4], raw_features[5], raw_features[6],
        fallback_reason, sizeof(fallback_reason), &fallback_siren
    );
    Serial.print("  4. Rule-based Safety Fallback: ");
    if (raw_hazard) {
        Serial.print("TRIGGERED ("); Serial.print(fallback_reason); Serial.println(")");
        event.siren_triggered = true;
    } else {
        Serial.println("NOMINAL (No raw override needed)");
    }

    // 5. Serialize JSON Event
    int json_len = subsense_serialize_event_json(&event, g_json_buf, sizeof(g_json_buf));
    Serial.println();
    Serial.println("  5. Emitted Cloud-Conformant JSON Risk Event Payload:");
    Serial.println(g_json_buf);

    // 6. Transmit over WiFi Mesh (ESP-NOW)
    if (subsense_wifi_mesh_is_ready()) {
        subsense_wifi_mesh_send(g_json_buf, (size_t)json_len);
        Serial.println("  --> [MESH] Event broadcast via WiFi Mesh (ESP-NOW).");
    }

    // 7. Actuate physical hardware
    if (event.siren_triggered) {
        digitalWrite(PIN_SIREN_LED, HIGH);
        Serial.println("  --> [HARDWARE] Onboard LED (GPIO 2) ACTIVATED (Siren ON)");
    } else {
        digitalWrite(PIN_SIREN_LED, LOW);
        Serial.println("  --> [HARDWARE] Onboard LED (GPIO 2) OFF (Nominal)");
    }
}

void run_live_simulation() {
    print_separator();
    Serial.println(">>> LIVE MINE SIMULATION: 40 Timesteps (Nominal -> Precursors -> Collapse)");
    print_separator();
    Serial.println("Watch real-time model scoring and hardware LED activation as subsidence develops:");
    Serial.println();

    subsense_buffer_init(&g_win_buf);

    for (int t = 1; t <= 40; t++) {
        float tilt, vib, disp, crack;
        const char* scenario_phase;

