sasikumar161106/subsense/edge/firmware/esp32_subsense_test/esp32_subsense_test.ino
        if (t <= 15) {
            scenario_phase = "Normal Baseline";
            tilt = 0.02f + (random(-5, 5) * 0.001f);
            vib = 0.03f + (random(0, 10) * 0.002f);
            disp = 0.1f + (t * 0.01f);
            crack = 0.0f;
        } else if (t <= 26) {
            scenario_phase = "Micro-Shearing";
            float prog = (float)(t - 15) / 11.0f;
            tilt = 0.05f + prog * 0.45f;
            vib = 0.05f + prog * 0.12f + (random(0, 8) * 0.01f);
            disp = 0.3f + prog * 2.2f;
            crack = (t > 22 ? 0.35f : 0.05f);
        } else {
            scenario_phase = "ROOF COLLAPSE ";
            float prog = (float)(t - 26) / 14.0f;
            tilt = 0.5f + prog * 2.8f;
            vib = 0.25f + prog * 0.85f;
            disp = 3.0f + prog * 11.5f; // Reaches catastrophic displacement
            crack = 0.4f + prog * 0.55f;
        }

        // Push to buffer
        subsense_buffer_push(&g_win_buf, tilt, vib, disp, crack);

        if (!subsense_buffer_is_full(&g_win_buf)) {
            Serial.print("[T="); Serial.print(t); Serial.print("/40] Buffering window... (");
            Serial.print(g_win_buf.count); Serial.println("/32 samples)");
            delay(100);
            continue;
        }

        // Run full step
        float raw_feat[8];
        subsense_extract_features(&g_win_buf, raw_feat);

        int8_t in_int8[8];
        subsense_features_to_int8(raw_feat, &g_feat_config, in_int8);

        SubSenseDetectionEvent ev;
        subsense_run_inference(in_int8, raw_feat, "2026-09-09T21:45:00Z", &g_gw_inf_config, &ev, &g_health);

        // Fallback check
        char fb_reason[64];
        bool fb_siren = false;
        bool raw_hazard = subsense_fallback_evaluate(
            raw_feat[0], raw_feat[1], raw_feat[4], raw_feat[5], raw_feat[6],
            fb_reason, sizeof(fb_reason), &fb_siren
        );
        if (raw_hazard) {
            ev.siren_triggered = true;
        }

        // Broadcast over WiFi Mesh on warning or critical alert
        if (ev.siren_triggered || strcmp(ev.threshold_breached, "none") != 0) {
            int json_len = subsense_serialize_event_json(&ev, g_json_buf, sizeof(g_json_buf));
            if (subsense_wifi_mesh_is_ready()) {
                subsense_wifi_mesh_send(g_json_buf, (size_t)json_len);
                Serial.println("  --> [MESH] Event transmitted over WiFi (ESP-NOW).");
            }
        }

        // Actuate LED
        if (ev.siren_triggered) {
            digitalWrite(PIN_SIREN_LED, HIGH);
        } else if (strcmp(ev.threshold_breached, "warning") == 0) {
            digitalWrite(PIN_SIREN_LED, (t % 2 == 0) ? HIGH : LOW); // Blink on warning
        } else {
            digitalWrite(PIN_SIREN_LED, LOW);
        }

        // Print telemetry line
        Serial.print("[T=");
        if (t < 10) Serial.print("0");
        Serial.print(t);
        Serial.print("] ");
        Serial.print(scenario_phase);
        Serial.print(" | Tilt:"); Serial.print(tilt, 2); Serial.print("°");
        Serial.print(" Vib:"); Serial.print(vib, 2); Serial.print("g");
        Serial.print(" Disp:"); Serial.print(disp, 1); Serial.print("mm");
        Serial.print(" Crack:"); Serial.print(crack, 2); Serial.print("mm");
        Serial.print(" | Score: "); Serial.print(ev.anomaly_score, 2);
        Serial.print(" ["); Serial.print(ev.threshold_breached); Serial.print("]");
        if (ev.siren_triggered) {
            Serial.print(" *** SIREN ACTIVE ***");
        }
        Serial.println();

        delay(150);
    }

    digitalWrite(PIN_SIREN_LED, LOW);
    Serial.println();
    Serial.println("  Simulation completed. Siren returned to standby.");
}

void print_power_report() {
    print_separator();
    Serial.println(">>> EMBEDDED POWER & BATTERY PROJECTIONS (2600 mAh 18650 Li-ion Cell)");
    print_separator();

    SubSensePowerConfig cfg = g_pwr_config;

    // Profile 1: 1.0 Hz Gateway Continuous
    cfg.mode = POWER_MODE_BATTERY_DUTY_CYCLE;
    cfg.sampling_interval_ms = 1000;
    cfg.active_duration_us = 400; // 0.4 ms
    float avg_ma_1s = subsense_power_calc_avg_current_ma(&cfg);
    float life_1s = subsense_power_calc_battery_life_months(&cfg);

    // Profile 2: 0.5 Hz (2.0s interval)
    cfg.sampling_interval_ms = 2000;
    float avg_ma_2s = subsense_power_calc_avg_current_ma(&cfg);
    float life_2s = subsense_power_calc_battery_life_months(&cfg);

    // Profile 3: 0.2 Hz (5.0s interval - Standard Deep Mining Node)
    cfg.sampling_interval_ms = 5000;
    float avg_ma_5s = subsense_power_calc_avg_current_ma(&cfg);
    float life_5s = subsense_power_calc_battery_life_months(&cfg);

    Serial.print("  1. High-Frequency Sampling (1.0 Hz / 1 sec interval):\n");
    Serial.print("     Average Current: "); Serial.print(avg_ma_1s * 1000.0f, 1); Serial.print(" uA | Projected Lifespan: ");
    Serial.print(life_1s, 1); Serial.print(" months (~"); Serial.print(life_1s / 12.0f, 1); Serial.println(" years)");

    Serial.print("  2. Standard Slope Monitoring (0.5 Hz / 2 sec interval):\n");
    Serial.print("     Average Current: "); Serial.print(avg_ma_2s * 1000.0f, 1); Serial.print(" uA | Projected Lifespan: ");
    Serial.print(life_2s, 1); Serial.print(" months (~"); Serial.print(life_2s / 12.0f, 1); Serial.println(" years)");

    Serial.print("  3. Deep Pillar Surveillance (0.2 Hz / 5 sec interval):\n");
    Serial.print("     Average Current: "); Serial.print(avg_ma_5s * 1000.0f, 1); Serial.print(" uA | Projected Lifespan: ");
    Serial.print(life_5s, 1); Serial.print(" months (~"); Serial.print(life_5s / 12.0f, 1); Serial.println(" years)");
    Serial.println();
    Serial.println("  Conclusion: Deep-sleep duty cycling enables 4+ years of uninterrupted underground operation.");
}

void print_menu() {
    Serial.println();
    print_separator();
    Serial.println("               SUBSENSE TINYML ESP32 INTERACTIVE CONSOLE");
    print_separator();
    Serial.println("  [1] Run Node Model Benchmark (2-Layer High-Recall Detector)");
    Serial.println("  [2] Run Gateway Model Benchmark (6-Layer INT8 Autoencoder)");
    Serial.println("  [3] Run Full Pipeline Test (Window -> Feature -> Model -> JSON Event)");
    Serial.println("  [4] Run Live Mine Subsidence Simulation (Calm -> Anomaly -> Collapse)");
    Serial.println("  [5] Print Power Consumption & 4-Year Battery Lifespan Report");
    Serial.println("  [6] Toggle Hardware Siren/LED (GPIO 2)");
    Serial.println("  [7] Print Self-Health Telemetry JSON");
    Serial.println("  [?] Print this Menu");
    print_separator();
    Serial.print("Enter command [1-7]: ");
}

void setup() {
    Serial.begin(115200);
    while (!Serial && millis() < 2500); // Wait for USB Serial connection

    // Configure hardware pins
    pinMode(PIN_SIREN_LED, OUTPUT);
    digitalWrite(PIN_SIREN_LED, LOW);

    // Boot LED flash (3 short blinks to confirm GPIO is active)
    for (int i = 0; i < 3; i++) {
        digitalWrite(PIN_SIREN_LED, HIGH);
        delay(80);
        digitalWrite(PIN_SIREN_LED, LOW);
        delay(80);
    }

    setup_subsense();

    Serial.println();
    print_separator();
    Serial.println("    SubSense TinyML On-Device Firmware Initialized on ESP32");
    Serial.println("    Author: SubSense Team | Smart India Hackathon 2026");
    Serial.println("    Hardware: ESP32 @ 240MHz | Zero Dynamic Heap Allocation");
#if defined(ESP_ARDUINO_VERSION)
    Serial.print("    ESP32 Arduino Core: v");
    Serial.print(ESP_ARDUINO_VERSION_MAJOR);
    Serial.print(".");
    Serial.print(ESP_ARDUINO_VERSION_MINOR);
    Serial.print(".");
    Serial.println(ESP_ARDUINO_VERSION_PATCH);
#elif defined(ARDUINO_ESP32_RELEASE)
    Serial.print("    ESP32 Arduino Core: ");
    Serial.println(ARDUINO_ESP32_RELEASE);
#endif
    Serial.print("    Underlying ESP-IDF: ");
    Serial.println(esp_get_idf_version());
    print_separator();
    Serial.println();

    // Run automatic on-boot self tests
    test_node_model();
    Serial.println();
    test_gateway_model();
    Serial.println();
    test_full_pipeline();

    print_menu();
}

void loop() {
    // Keep WiFi Mesh housekeeper running (for gateway reassembly & timeout drops)
    subsense_wifi_mesh_loop();

