sasikumar161106/subsense/edge/firmware/esp32_subsense_test/esp32_subsense_test.ino
    if (Serial.available() > 0) {
        char cmd = Serial.read();
        // Ignore newline / carriage return
        if (cmd == '\r' || cmd == '\n' || cmd == ' ') return;

        Serial.println(cmd);

        switch (cmd) {
            case '1':
                test_node_model();
                break;
            case '2':
                test_gateway_model();
                break;
            case '3':
                test_full_pipeline();
                break;
            case '4':
                run_live_simulation();
                break;
            case '5':
                print_power_report();
                break;
            case '6': {
                static bool led_state = false;
                led_state = !led_state;
                digitalWrite(PIN_SIREN_LED, led_state ? HIGH : LOW);
                Serial.print("Hardware Siren/LED Pin (GPIO ");
                Serial.print(PIN_SIREN_LED);
                Serial.print(") set to: ");
                Serial.println(led_state ? "ON (HIGH)" : "OFF (LOW)");
                break;
            }
            case '7': {
                subsense_serialize_health_json(&g_health, g_health_buf, sizeof(g_health_buf));
                Serial.println("SubSense Self-Health Telemetry JSON:");
                Serial.println(g_health_buf);
                break;
            }
            case '?':
            case 'h':
            case 'H':
                print_menu();
                break;
            default:
                Serial.print("Unknown command '"); Serial.print(cmd); Serial.println("'. Press '?' for menu.");
                break;
        }

        print_menu();
    }
}
